In [32]:
import pandas as pd

In [33]:
dict = { 'Name' : ['sbc','hdg','roe','lsi','fyhri','dsyu'],
        'marks':[45,67,32,78,54,34],
        'Gender':['male','female','male','female','male','female']}

df = pd.DataFrame(dict)
print(df)

    Name  marks  Gender
0    sbc     45    male
1    hdg     67  female
2    roe     32    male
3    lsi     78  female
4  fyhri     54    male
5   dsyu     34  female

In [34]:
df.head(3)

  Name  marks  Gender
0  sbc     45    male
1  hdg     67  female
2  roe     32    male

In [35]:
df.tail(3)

    Name  marks  Gender
3    lsi     78  female
4  fyhri     54    male
5   dsyu     34  female

In [36]:
df.rename(columns={'marks':'Marks'}) # renameing column

    Name  Marks  Gender
0    sbc     45    male
1    hdg     67  female
2    roe     32    male
3    lsi     78  female
4  fyhri     54    male
5   dsyu     34  female

In [37]:
df.shape # to check the shape of the dataset including number of rows and column
print("rows",df.shape[0])
print("column",df.shape[1])

rows 6
column 3

In [38]:
df.info() # gives all the information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   marks   6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [39]:
df.isnull().sum(axis=0) # to check any null value with row = 1 and column = 0

Name      0
marks     0
Gender    0
dtype: int64

In [40]:
df.describe(include='all') # to check the statistic

       Name      marks Gender
count     6   6.000000      6
unique    6        NaN      2
top     sbc        NaN   male
freq      1        NaN      3
mean    NaN  51.666667    NaN
std     NaN  18.315749    NaN
min     NaN  32.000000    NaN
25%     NaN  36.750000    NaN
50%     NaN  49.500000    NaN
75%     NaN  63.750000    NaN
max     NaN  78.000000    NaN

In [41]:
df['Gender'].unique() # to check the values in one series

array(['male', 'female'], dtype=object)

In [42]:
df['Gender'].nunique() # to check the total number of unique values

2

In [43]:
df['Gender'].value_counts()

male      3
female    3
Name: Gender, dtype: int64

In [44]:
df

    Name  marks  Gender
0    sbc     45    male
1    hdg     67  female
2    roe     32    male
3    lsi     78  female
4  fyhri     54    male
5   dsyu     34  female

In [45]:
df[df['marks']>=45][['Name']]

    Name
0    sbc
1    hdg
3    lsi
4  fyhri

In [46]:
df[(df['marks']>=45) & (df['marks']<=65)]

    Name  marks Gender
0    sbc     45   male
4  fyhri     54   male

In [47]:
df[df['marks'].between(45,65)]

    Name  marks Gender
0    sbc     45   male
4  fyhri     54   male

In [48]:
df['marks'].min()

32

In [49]:
df['marks'].max()

78

In [50]:
df['marks'].mean()

51.666666666666664

In [51]:
def half(x): # using apply method we can use any function 
    return x//2

df['half_marks']= df['marks'].apply(half)
df

    Name  marks  Gender  half_marks
0    sbc     45    male          22
1    hdg     67  female          33
2    roe     32    male          16
3    lsi     78  female          39
4  fyhri     54    male          27
5   dsyu     34  female          17

In [52]:
df["len_of_string"] = df['Name'].apply(len)
df

    Name  marks  Gender  half_marks  len_of_string
0    sbc     45    male          22              3
1    hdg     67  female          33              3
2    roe     32    male          16              3
3    lsi     78  female          39              3
4  fyhri     54    male          27              5
5   dsyu     34  female          17              4

In [53]:
df["encode"]= df['Gender'].map({"male":1 , "female":0})
df

    Name  marks  Gender  half_marks  len_of_string  encode
0    sbc     45    male          22              3       1
1    hdg     67  female          33              3       0
2    roe     32    male          16              3       1
3    lsi     78  female          39              3       0
4  fyhri     54    male          27              5       1
5   dsyu     34  female          17              4       0

In [66]:
df.drop(['encode','half_marks'], axis = 1, inplace=True)

KeyError: "['encode', 'half_marks'] not found in axis"

In [55]:
df.columns

Index(['Name', 'marks', 'Gender', 'len_of_string'], dtype='object')

In [56]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [57]:
df.sort_values(by="marks", ascending=False)

    Name  marks  Gender  len_of_string
3    lsi     78  female              3
1    hdg     67  female              3
4  fyhri     54    male              5
0    sbc     45    male              3
5   dsyu     34  female              4
2    roe     32    male              3

In [58]:
df[df['Gender'] == "female"][['Name','marks']]

   Name  marks
1   hdg     67
3   lsi     78
5  dsyu     34